vet_clinic/app/views/vets/show.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."vet_id" = 1
---
      <tbody>
        <% @vet.appointments.each do |appointment| %>