vet_clinic/app/views/pets/show.html.erb

SELECT "owners".* FROM "owners" WHERE "owners"."id" = 1 LIMIT 1
---
      <strong>Owner:</strong>
      <%= link_to "#{@pet.owner.first_name} #{@pet.owner.last_name}", owner_path(@pet.owner) %>

SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1
---
      <tbody>
        <% @pet.appointments.each do |appointment| %>

SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1 LIMIT 1
---
            <td><%= link_to appointment.date.strftime("%B %d, %Y"), appointment_path(appointment) %></td>
            <td><%= link_to "#{appointment.vet.first_name} #{appointment.vet.last_name}", vet_path(appointment.vet) %></td>