vet_clinic/app/views/appointments/show.html.erb

      <strong>Vet:</strong>
      <%= link_to "#{@appointment.vet.first_name} #{@appointment.vet.last_name}", vet_path(@appointment.vet) %>
---
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1 LIMIT 1

      <tbody>
        <% @appointment.treatments.each do |treatment| %>
---
SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" = 1