vet_clinic/app/views/owners/index.html.erb

            <td><%= owner.phone %></td>
            <td><%= owner.pets.count %></td>
---
SELECT COUNT(*) FROM "pets" WHERE "pets"."owner_id" = 1